# Load Packages

In [1]:
import pandas as pd
import numpy as np

# Load dataset

In [3]:
df=pd.read_csv("salaries.csv")

# Understanding Data
**For understanding data we can ask these basic questions**

1. **Shape of data**
2. **Datatypes**
3. **How many columns are**
4. **Null values**
5. **Duplicates**
6. **Statistical Summary**
7. **Info**

# What is the shape of data

In [4]:
df.shape

(13972, 11)

# What the data look like

In [15]:
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2024,SE,FT,AI Engineer,90000,USD,90000,AE,0,AE,L
1,2024,SE,FT,Machine Learning Engineer,180500,USD,180500,US,0,US,M
2,2024,SE,FT,Machine Learning Engineer,96200,USD,96200,US,0,US,M
3,2024,SE,FT,Machine Learning Engineer,235000,USD,235000,AU,0,AU,M
4,2024,SE,FT,Machine Learning Engineer,175000,USD,175000,AU,0,AU,M

In [17]:
df.sample(5)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
5190,2023,SE,FT,Data Analyst,105000,USD,105000,US,0,US,M
4701,2023,MI,FT,Machine Learning Engineer,130000,USD,130000,US,0,US,M
6562,2023,SE,FT,Data Modeler,140000,USD,140000,US,0,US,M
1391,2024,MI,FT,Business Intelligence Manager,207000,USD,207000,US,0,US,M
12795,2022,MI,FT,Analytics Engineer,78000,USD,78000,BR,100,BR,M

# Datatypes

In [5]:
df.dtypes

work_year              int64
experience_level      object
employment_type       object
job_title             object
salary                 int64
salary_currency       object
salary_in_usd          int64
employee_residence    object
remote_ratio           int64
company_location      object
company_size          object
dtype: object

# How many columns are

In [6]:
df.columns

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

# Null values

In [7]:
df.isnull().sum()

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

# Duplicates

In [8]:
df.duplicated().sum()

5378

**These are the duplicates so we can drop duplicates**

In [10]:
df.drop_duplicates(inplace=True)

In [11]:
df.duplicated().sum()

0

# Statistical Summary

### Num-Col

In [12]:
df.describe()

         work_year        salary  salary_in_usd  remote_ratio
count  8594.000000  8.594000e+03    8594.000000   8594.000000
mean   2023.091808  1.729008e+05  146745.224343     37.229462
std       0.773301  4.642394e+05   72989.158332     47.619870
min    2020.000000  1.400000e+04   15000.000000      0.000000
25%    2023.000000  9.600000e+04   95019.000000      0.000000
50%    2023.000000  1.400000e+05  138750.000000      0.000000
75%    2024.000000  1.885000e+05  185900.000000    100.000000
max    2024.000000  3.040000e+07  800000.000000    100.000000

### Cat-Col

In [13]:
df.describe(include='object')

,experience_level,employment_type,job_title,salary_currency,employee_residence,company_location,company_size
count,8594,8594,8594,8594,8594,8594,8594
unique,4,4,146,23,88,77,3
top,SE,FT,Data Engineer,USD,US,US,M
freq,5168,8534,1635,7667,7026,7075,7805

# Info

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8594 entries, 0 to 13971
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           8594 non-null   int64
 1   experience_level    8594 non-null   object
 2   employment_type     8594 non-null   object
 3   job_title           8594 non-null   object
 4   salary              8594 non-null   int64
 5   salary_currency     8594 non-null   object
 6   salary_in_usd       8594 non-null   int64
 7   employee_residence  8594 non-null   object
 8   remote_ratio        8594 non-null   int64
 9   company_location    8594 non-null   object
 10  company_size        8594 non-null   object
dtypes: int64(4), object(7)
memory usage: 805.7+ KB